<?php
//Arabic langugae
// KLEEJA 


	if(!isset($lang) || !is_array($lang)) $lang = array();
	
	$lang['DIR']								= 'rtl';
	$lang['INST_INSTALL_WIZARD']				= 'معالج تثبيت كليجا';
	$lang['INST_INSTALL_CLEAN_VER']				= "تثبيت نسخه جديده ";
	$lang['INST_UPDATE_P_VER']					= "تحديث نسخه سابقه ";
	$lang['INST_AGR_LICENSE']					= 'أوافق على شروط ترخيص إستخدام كليجا .';
	$lang['INST_NEXT']							= 'التالي';
	$lang['INST_PREVIOUS']						= 'السابق';
	$lang['INST_SITE_INFO']						= 'أدخل بيانات المركز ..!';
	$lang['INST_ADMIN_INFO']					= 'أدخل بيانات مدير المركز ..!';
	$lang['INST_CHANG_CONFIG']					= 'بعض البيانات المهمه ناقصه إملأ ملف config.php';
	$lang['INST_CONNCET_ERR']					= 'لا يمكن الإتصال ..';
	$lang['INST_SELECT_ERR']					= 'لا يمكن الإرتباط بقاعدة البيانات';
	$lang['INST_NO_WRTABLE']					= 'مجلد غير قابل للكتابه .. يحتاج تصريح 777';
	$lang['INST_GOOD_GO']						= 'تم التأكد من المتغييرات والإتصال والتراخيص .. تابع';
	$lang['INST_MSGINS']						= 'يمكنك تحميل ماتشاء وفق المسموح به .. شكراُ لزيارتك';
	$lang['INST_CRT_CALL']						= 'تم إنشاء جدول المراسلات';
	$lang['INST_CRT_ONL']						= 'تم إنشاء جدول المتواجدون الآن';
	$lang['INST_CRT_REPRS']						= 'تم إنشاء جدول التبليغات';
	$lang['INST_CRT_STS']						= 'تم إنشاء جدول الإحصائيات';
	$lang['INST_CRT_USRS']						= 'تم إنشاء جدول الأعضاء';
	$lang['INST_CRT_ADM']						= 'تم إدخال معلومات المسؤول';
	$lang['INST_CRT_FLS']						= 'تم إنشاء جدول الملفات';
	$lang['INST_CRT_CNF']						= 'تم إنشاء جدول الإعدادات';
	$lang['INST_CRT_EXT']						= 'تم إنشاء جدول الإمتدادات';
	$lang['INST_CRT_HKS']						= 'تم إنشاء جدول الهاكات';
	$lang['INST_CRT_LNG']						= 'تم إنشاء جدول اللغه';
	$lang['INST_CRT_LSTS']						= 'تم إنشاء جدول القوائم';
	$lang['INST_CRT_PLG']						= 'تم إنشاء جدول الإضافات';
	$lang['INST_CRT_TPL']						= 'تم إنشاء جدول القوالب';
	$lang['INST_SQL_OK']						= 'تم تنفيذ الإستعلام بنجاح ..';
	$lang['INST_SQL_ERR']						= 'خطأ في تنفيذ الإستعلام';
	$lang['INST_FINISH_SQL']					= 'تم تثبيت كليجا بنجاح';
	$lang['INST_NOTES']							= 'ملاحظات التثبيت ..!';
	$lang['INST_END']							= 'معالج التثبيت انتهى ,, يجب الآن حذف مجلد INSTALL <span style="color:red">(الموقع لن يعمل في حال وجود المجلد)</span> ..!';
	$lang['INST_NOTE_D']						= 'أي ملاحظات أو مشاكل تتعلق بأداء كليجا ,, نرجوا التواصل مع مطوري كليجا ..!!';
	$lang['INST_FINISH_ERRSQL']					= 'هناك مشكله تعيق التثبيت ، تأكد من حساب مستخدم القاعدة وحاول مجدداً او استفسر من مطوري كليجا !';
	$lang['INST_KLEEJADEVELOPERS']				= 'شكراً لإستخدامك كليجا ,,, مع أحلى و أطيب التمنيات .. من فريق عمل كليجا';
	$lang['SITENAME']							= 'اسم الموقع';
	$lang['SITEURL']							= 'رابط الموقع';
	$lang['SITEMAIL']							= 'بريد الموقع';
	$lang['USERNAME']							= 'اسم المستخدم';
	$lang['PASSWORD']							= 'كلمة المرور';
	$lang['PASSWORD2']							= 'أعد كلمة المرور';
	$lang['EMAIL']								= 'البريد الالكتروني';
	$lang['INDEX']								= 'الرئيسيه';
	$lang['ADMINCP']							= 'لوحة التحكم';
	$lang['EMPTY_FIELDS']						= 'هنـــاك حقول مهمه, تركتها فارغه...';
	$lang['WRONG_EMAIL']						= 'البريد الإلكتروني خاطئ !';
	//
	
	$lang['DB_INFO_NW']							= 'أدخل بيانات القاعدة بشكل صحيح ، واضغط على (تصدير الملف)وسيقوم المعالج بتصدير ملف config.php لتضعه في مجلد السكربت الرئيسي  كما يتضح لك بالصورة!';
	$lang['DB_INFO']							= 'أدخل معلومات قاعدة البيانات ..!';
	$lang['DB_SERVER']							= 'الخادم';
	$lang['DB_TYPE']							= 'نوع قاعده البيانات';
	$lang['DB_TYPE_MYSQL']						= 'MySQL القياسي';
	$lang['DB_TYPE_MYSQLI']						= 'MySQL المطور';
	$lang['DB_USER']							= 'اسم المستخدم لقاعدة البيانات';
	$lang['DB_PASSWORD']						= 'كلمة المرور لقاعدة البيانات';
	$lang['DB_NAME']							= 'إسم قاعدة البيانات';
	$lang['DB_PREFIX']							= 'بادئة الجداول';
	$lang['VALIDATING_FORM_WRONG']				= 'يبدو أنك تركت أحد الحقول المطلوبه فارغاً ...';
	$lang['CONFIG_EXISTS']						= 'تم إيجاد ملف config.php قم بالمتابعه ...';
	$lang['INST_SUBMIT_CONFIGOK']				= 'أرفع ملف config.php في دليل كليجا الرئيسي وتابع عملية التثبيت ..!!';
	$lang['INST_EXPORT']						= 'تصدير الملف';
	$lang['INST_OTHER_INFO']					= 'معلومات اخرى';
	$lang['URLS_TYPES']							= 'شكل روابط الملفات';
	$lang['DEFAULT']							= 'الافتراضي';
	$lang['FILENAME_URL']						= 'اسماء الملفات';
	$lang['DIRECT_URL']							= 'روابط مباشره';
	$lang['LIKE_THIS']							= 'مثال';

	//
	$lang['FUNCTIONS_CHECK']					= 'فحص الدوال';
	$lang['RE_CHECK']							= 'إعادة الفحص';
	$lang['FUNCTION_IS_NOT_EXISTS']				= 'الدالة %s معطله لديك.';
	$lang['FUNCTION_IS_EXISTS']					= 'الدالة %s مفعله لديك.';
	$lang['FUNCTION_DISC_UNLINK']				= 'دالة unlink يتم استخدامها لحذف الملفات وأيضا لحذف ملفات الكاش وتحديثها.';
	$lang['FUNCTION_DISC_GD']					= 'دالة imagecreatetruecolor هي من دوال مكتبة GD التي تستخدم لإنشاء مصغرات الصور والكود الأمني , عدم وجود الداله غالبا يعني عدم تواجد مكتبه GD على السيرفر .. ';
	$lang['FUNCTION_DISC_FOPEN']				= 'دالة fopen تستخدم في التحكم بالستايل والملفات في كليجا.';
	$lang['FUNCTION_DISC_MUF']					= 'دالة move_uploaded_file تستخدم لتحميل الملفات  وهي اهم دالة في السكربت.';
	//
	$lang['ADVICES_CHECK']						= 'فحص متقدم (يمكن تثبيت كليجا بدون تحقق هذا الفحص , لكنه مجرد معلومات لك)';
	$lang['ADVICES_REGISTER_GLOBALS']			= '<span style="color:red;padding:0 6px;">خاصية register_globals مفعله ..!</span><br /> هذه الخاصيه غير محبب تفعيلها ويفضل تعطيلها , ومع هذا فكليجا تحاول تعطيل اثارها برمجياً .';
	$lang['ADVICES_MAGIC_QUOTES']				= '<span style="color:red;padding:0 6px;">خاصية magic_quotes مفعله ..!</span><br /> هذه الخاصيه غير محبب تفعيلها ويفضل تعطيلها , ومع هذا فكليجا تحاول تعطيل اثارها برمجياً ..';
	
	//UPDATOR
	$lang['INST_CHOOSE_UPDATE_FILE']			= 'قم بإختيار التحديث المناسب لك ومن ثم تابع التحديث ..';
	$lang['INST_ERR_NO_SELECTED_UPFILE_GOOD']	= 'ملف التحديث غير مناسب او انه غير موجود من الأساس ! ..';
	$lang['INST_UPDATE_CUR_VER_IS_UP']			= 'النسخه الحاليه محدثه لهذا التحديث المحدد.';
	
	$lang['INST_NOTES_UPDATE']					= 'ملاحظات التحديث';
	$lang['INST_NOTE_RC6_TO_1.5']				= 
	$lang['INST_NOTE_1.0_TO_1.5']				= 'التحديث سيعمل بكفاءة بعد هذه الخطوة التي هي تحديث للقاعدة و ايضا لابد ان تكون قد بدلت ملفات كليجا بالنسخه الجديدة.!!';
	$lang['RC6_1_CNV_CLEAN_NAMES']				= 'جاري تحديث كل عضو لوضع الاسم النظيف ...';
	
	$lang['INST_UPDATE_IS_FINISH']				= 'معالج التحديث انتهى .. يجب الآن حذف مجلد INSTALL و متابعة عملك في كليجا .';
	$lang['IN_INFO']							= 'ادخل معلومات السكربت الذي تريد ربط كليجا معه  كنظام عضويات أو تجاهل هذه الخطوه اذا كنت ترغب بنظام العضويات العادي ..<br /><span style="color:red;">ملاحظة : بعد الانتهاء من ثبيت كليجا قم باختيار نظام الاعضاء من لوحة التحكم في كليجا</span>';
	$lang['IN_PATH']							= 'مجلد السكربت';
	$lang['INST_PHP_LESSMIN']					= 'لتثبيت كليجا يجب على الأقل أن يكون لديك اصدار PHP %1$s , وانت لديك اصدار PHP %2$s.';
	$lang['INST_MYSQL_LESSMIN']					= 'لتثبيت كليجا يجب على الأقل أن يكون لديك اصدار MYSQL %1$s , وانت لديك اصدار MYSQL %2$s.';
	$lang['IS_IT_OFFICIAL']						= 'هل قمت بتحميل النسخه من الموقع الرسمي Kleeja.com ؟';
	$lang['IS_IT_OFFICIAL_DESC']				= 'يصلنا الكثير من الشكاوي والتساؤلات عن سبب بعض المشاكل التي تحدث في بعض النسخ ولا نستطيع معرفة المشكلة غالباً , لكن بعد البحث وجدنا ان هناك نسخاً يتم تحميلها من مواقع اخرى غير رسميه وتكون اما معدلة بطريقة بدائية او مزروع داخلها اكواد خبيثه.<span class="sure">لذا , هل انت متأكد من ان نسختك هذه تم تحميلها من الموقع الرسمي : kleeja.com ؟</span>';
	$lang['IS_IT_OFFICIAL_YES']					= 'نعم , نسختي قمت بتحميلها من الموقع الرسمي kleeja.com';
	$lang['IS_IT_OFFICIAL_NO']					= 'لا , لم اقم بتحميلها من هناك , حولني للموقع  الرسمي للتحميل الان';
	$lang['INST_WHAT_IS_KLEEJA_T']				= 'ماهي كليجا ؟';
	$lang['INST_WHAT_IS_KLEEJA']				= 'Kleeja  تنطق عربياً  "كليجا" ..! وكتعريف مبسط "كليجا" سكربت رفع ملفات مجاني يأتي مع خصائص فريده لمساعدة أصحاب المواقع بإمتلاك مركز تحميل قوي ويعتمد عليه  , والحقيقة أن "كليجا" سكربت ضخم الامكانيات سهل الإدارة تم بناء نظام الحماية على مستوى عالي ويملك من الأنظمة المعقدة ما يؤمن لموقعك الحماية التامة بإذن الله ..!';
	$lang['INST_SPECIAL_KLEEJA']				= 'من أهم مميزات كليجا ..!';
	$lang['INST_WHAT_IS_KLEEJA_ONE']			= '1. نظام أعضاء قوي تستطيع ربطه بأغلب السكربتات المستخدمة في المواقع الاجتماعية .<br />2. لوحة تحكم مذهله ليس فقط للتحكم بالملفات ولكن للتحكم  بكل صغيرة وكبيرة  .<br />3. نظام الستايلات البسيط يجعلك تستطيع ان تصنع ستايلك بنفسك.<br />4. مع كليجا ونظام الإضافات البرمجية تستطيع أن تقوم بتركيب الكثير من الاضافات الرائعة .<br />5. ليس هذا فحسب بل كليجا تملك الكثير .. لتعرف أكثر رجاءاً قم بزيارة صفحه <a target="_blank" href="http://www.kleeja.com/about/">معلومات ومميزات</a> .';
	$lang['YES']								= 'نعم';
	$lang['NO']									= 'لا';
	$lang['PASS_X_CHARS']						= 'قم بإدخال  %d احرف كحد أدنى';
	$lang['PASS_X_TYPE']						= array('ضعيفه', 'عاديه', 'متوسطه', 'صعبه', 'صعبه جداً');
	$lang['KLEEJA_TEAM_MSG_NAME']				= 'فريق تطوير كليجا';
	$lang['KLEEJA_TEAM_MSG_TEXT']				= "شكراً لاختيارك سكربت الرفع الأول كليجا\n نتمنى حقا ان تستمتع بالسكربت و لاتنسى زيارة موقع كليجا لطلب الدعم وتحميل مرفقات السكربت.\nhttp://www.kleeja.com";
	
	//PLUGINS
	$lang['PLUGINS_KLEEJA']						= 'إضافات كليجا .. !';
	$lang['PLUGINS_BUILT_IN']					= 'هذه اضافات تأتي مع كليجا بشكل افتراضي , اذا اردت ازالة تضمين احدها فكل ماعليك هو ازالة التعليم من أمامها , ولكن ننصحك بعدم فعل ذلك لان هذه الاضافات تم التحقق منها وهي مفيده لعمل كليجا بشكل عام ,, وللحصول على المزيد من الاضافات قم بزيارة موقع <a style="color:red" target="_blank" href="http://www.kleeja.com/plugins/">kleeja.com !</a>';
	$lang['PLUGINS_NAME']						= 'اسم الاضافة';
	$lang['PLUGINS_VER']						= 'الإصدار';
	$lang['PLUGINS_DES']						= 'وصف الاضافة';	
	$lang['PLUGINS_INSTALLED']					= 'تم تثبيت هذه الاضافات بنجاح !!';		

	
//<-- EOF
